DataProcessors/ТерминалСамообслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ТерминалСамообслуживания</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТерминалСамообслуживания/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем мПоследняяВкладка;

//СЕРВИСНЫЕ ФУНКЦИИ
&НаСервере
Процедура УбратьПанелиИнтерфейсаНаСервере()
	
	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
	
	// Очистить настройки состава.
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Право.Очистить();
	
	// Загрузить настройки состава в пустой объект настроек.
	НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	
	// Положить объект настроек текущему пользователю в хранилище.
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуТовара(Знач Номенклатура, Знач Характеристика)
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("ВидЦен, КонтрагентТерминалаСамообслуживания");
	
	ВидЦен = РеквизитыПользователя.КонтрагентТерминалаСамообслуживания.ОсновнойДоговор.ВидЦен;
	Если ВидЦен.Пустая() Тогда
		ВидЦен = РеквизитыПользователя.ВидЦен;
	КонецЕсли;	
	Если ВидЦен.Пустая() Тогда
		ВидЦен = Справочники.ВидыЦен.ОсновнаяЦенаПродажи;
	КонецЕсли;
	Если Номенклатура = Неопределено Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	Если Характеристика = Неопределено Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &Характеристика
	|				И ЕдиницаИзмерения = &ЕдиницаИзмерения) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ВидЦены",ВидЦен);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",Номенклатура.БазоваяЕдиницаИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ЗаполнитьСписокХарактеристик(Номенклатура)
	
	СписокХарактеристики.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Характеристики.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК Характеристики
	|ГДЕ
	|   НЕ Характеристики.ПометкаУдаления
	|   И Характеристики.Владелец = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Характеристики.Наименование";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокХарактеристики.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если СписокХарактеристики.Количество() = 0 Тогда
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Иначе
		Возврат СписокХарактеристики.Получить(0).Значение;
	КонецЕсли;	
	
КонецФункции
	
&НаСервере
Функция ПолучитьСписокТоваровДляСтраницы(Знач Родитель = Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	СписокРезультата = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование";
	Запрос.УстановитьПараметр("Родитель",Родитель);
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНоменклатура.Следующий() Цикл
		СписокРезультата.Добавить(ВыборкаНоменклатура.Ссылка);
	КонецЦикла;
	
	Возврат СписокРезультата;
	
КонецФункции
	
&НаСервере
Процедура ОбновитьСписокТоваров(Знач НомерСтраницыТоваров = 1, Знач ВыбраннаяГруппа = Неопределено)
	
	КоличествоТоваровНаСтранице = 15; 
	
	Если ВыбраннаяГруппа = Неопределено Тогда
		ТекущаяГруппаТоваров = Константы.ТерминалСамообслуживанияГруппаНоменклатуры.Получить();
	КонецЕсли;
	Если ТекущаяГруппаТоваров.Пустая() Тогда
		ТекущаяГруппаТоваров = Константы.ТерминалСамообслуживанияГруппаНоменклатуры.Получить();
	КонецЕсли;
	
	СписокТоваров = ПолучитьСписокТоваровДляСтраницы(ТекущаяГруппаТоваров);
	НомерКнопки = 1;
	Для НомерТовара = (НомерСтраницыТоваров-1)*КоличествоТоваровНаСтранице По ((КоличествоТоваровНаСтранице*НомерСтраницыТоваров)-1) Цикл
		Если НомерТовара < СписокТоваров.Количество() Тогда
			НоменклатураДляКнопки = СписокТоваров.Получить(НомерТовара).Значение;
			Элементы["КартинкаТовара"+(НомерКнопки)].Видимость = Истина;
			Элементы["КартинкаТовара"+(НомерКнопки)].Заголовок = НоменклатураДляКнопки;
			
			//++ №7722 комментируем, т.к. можно упросить и теперь для элемента номенклатуры, для хранения изображения используется отдельный справочник
			//Если НомерКнопки = 1 Тогда
			//	КартинкаТовара1 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 2 Тогда
			//	КартинкаТовара2 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 3 Тогда
			//	КартинкаТовара3 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 4 Тогда
			//	КартинкаТовара4 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 5 Тогда
			//	КартинкаТовара5 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 6 Тогда
			//	КартинкаТовара6 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 7 Тогда
			//	КартинкаТовара7 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 8 Тогда
			//	КартинкаТовара8 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 9 Тогда
			//	КартинкаТовара9 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 10 Тогда
			//	КартинкаТовара10 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 11 Тогда
			//	КартинкаТовара11 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 12 Тогда
			//	КартинкаТовара12 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 13 Тогда
			//	КартинкаТовара13 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 14 Тогда
			//	КартинкаТовара14 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//ИначеЕсли НомерКнопки = 15 Тогда
			//	КартинкаТовара15 = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки,"Фото");
			//КонецЕсли;
			//-- №7722
			
			// №7722 фото в зависмости от признака ЭтоГруппа
			АдресКартинки = "";
			Если НоменклатураДляКнопки.ЭтоГруппа Тогда
				АдресКартинки = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки, "Фото");
			Иначе
				АдресКартинки = ПолучитьНавигационнуюСсылку(НоменклатураДляКнопки.ФайлКартинки, "ФайлХранилище");
			КонецЕсли;	
			ЭтаФорма["КартинкаТовара" + НомерКнопки] = АдресКартинки;
			
			Если НоменклатураДляКнопки.ЭтоГруппа Тогда
				Элементы["КартинкаТовара"+(НомерКнопки)].ШрифтЗаголовка = Новый Шрифт(Элементы["КартинкаТовара"+(НомерКнопки)].ШрифтЗаголовка,,,Истина);
				Если СтрДлина(Элементы["КартинкаТовара"+(НомерКнопки)].Заголовок) > 17 Тогда
					Элементы["КартинкаТовара"+(НомерКнопки)].Заголовок = Лев(Элементы["КартинкаТовара"+(НомерКнопки)].Заголовок,17)+"...";
				КонецЕсли;
				Элементы["КартинкаТовара"+(НомерКнопки)].РазмерКартинки = РазмерКартинки.Растянуть;
			Иначе
				Элементы["КартинкаТовара"+(НомерКнопки)].ШрифтЗаголовка = Новый Шрифт(Элементы["КартинкаТовара"+(НомерКнопки)].ШрифтЗаголовка,,,Ложь);
				Если СтрДлина(Элементы["КартинкаТовара"+(НомерКнопки)].Заголовок) > 20 Тогда
					Элементы["КартинкаТовара"+(НомерКнопки)].Заголовок = Лев(Элементы["КартинкаТовара"+(НомерКнопки)].Заголовок,17)+"...";
				КонецЕсли;
			КонецЕсли;
		Иначе
			Элементы["КартинкаТовара"+(НомерКнопки)].Видимость = Ложь;
		КонецЕсли;
		НомерКнопки = НомерКнопки + 1;
	КонецЦикла;
	
	Если ТекущаяГруппаТоваров.Пустая() Тогда
		Элементы.ПредыдущаяГруппаТоваров.Доступность = Ложь;
	Иначе
		Элементы.ПредыдущаяГруппаТоваров.Доступность = Истина;
	КонецЕсли;
	Если НомерСтраницыТоваров = 1 Тогда
		Элементы.ПредыдущаяСтраницаТоваров.Доступность = Ложь;
	Иначе
		Элементы.ПредыдущаяСтраницаТоваров.Доступность = Истина;
	КонецЕсли;
	Если ВыбранныйТовар.Пустая() Тогда
		Элементы.ПеренестиТоварВЗаказ.Доступность = Ложь;
	Иначе
		Элементы.ПеренестиТоварВЗаказ.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ДекорацияКоличествоТоваровВКорзине.Заголовок = Объект.Товары.Итог("Количество");
	Элементы.ДекорацияСуммаТоваровВКорзине.Заголовок = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранТовар(Знач НомерТовара)
	
	ВыбраннаяНоменклатура = СписокТоваров.Получить((НомерСтраницыТоваров-1)*15+(НомерТовара-1)).Значение;
	Если ЭтоГруппаНоменклатуры(ВыбраннаяНоменклатура) Тогда
		ВыбранныйТовар = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"); //Справочники.Номенклатура.ПустаяСсылка();
		Элементы.ДекорацияНадписьВыбранныйТовар.Заголовок = ВыбранныйТовар; //ВыбранныйТовар.Наименование;
		ТекущаяГруппаТоваров = ВыбраннаяНоменклатура;
		ОбновитьСписокТоваров(1, ТекущаяГруппаТоваров);
	Иначе
		ВыбранныйТовар = ВыбраннаяНоменклатура;
		ВыбраннаяХарактеристика = ЗаполнитьСписокХарактеристик(ВыбраннаяНоменклатура);
		ЦенаТовара = ПолучитьЦенуТовара(ВыбранныйТовар, ВыбраннаяХарактеристика);
		Элементы.ДекорацияНадписьВыбранныйТовар.Заголовок = ВыбранныйТовар; //ВыбранныйТовар.Наименование;
		Элементы.ГруппаХарактеристика.Видимость = (СписокХарактеристики.Количество() > 0);
		КоличествоТовара = 1;
		
		// №7722 фото по номенклатуре теперь в справочнике
		//ДанныеТовараФото = ПолучитьНавигационнуюСсылку(ВыбранныйТовар,"Фото");
		ДанныеТовараФото = ПолучитьНавигационнуюСсылку(ПолучитьСсылкуНаФайлКартинкиНаСервере(ВыбранныйТовар), "ФайлХранилище");
				
		ПоказатьСкрытьВкладки(5);
	КонецЕсли;
	
	Если ВыбранныйТовар.Пустая() Тогда
		Элементы.ПеренестиТоварВЗаказ.Доступность = Ложь;
	Иначе
		Элементы.ПеренестиТоварВЗаказ.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// №7722 фото по номенклатуре теперь в справочнике
&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаФайлКартинкиНаСервере(СсылкаНаНоменклатуру)
	
	Возврат СсылкаНаНоменклатуру.ФайлКартинки;
	
КонецФункции	

&НаСервере
Функция ЭтоГруппаНоменклатуры(Номенклатура)
	Возврат Номенклатура.ЭтоГруппа;
КонецФункции

&НаСервере
Процедура ПоднятсяНаГруппуВыше()
	
	НомерСтраницыТоваров = 1;
	ТекущаяГруппаТоваров = ТекущаяГруппаТоваров.Родитель;
	ОбновитьСписокТоваров(1, ТекущаяГруппаТоваров);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументЗаказПокупателя()
	
	//Начало изменен при переходе на 2.0
	//Если НЕ Константы.ТерминалСамообслуживанияЗаказНаПроизводство.Получить() Тогда
		НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
	//Иначе
	//	НовыйДокумент = Документы.ЗаказНаПроизводство.СоздатьДокумент();
	//	НовыйДокумент.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ЗаказНаПродажу;
	//	НовыйДокумент.ЗаказНаПродажу = Истина;
	//КонецЕсли;
	//Конец изменен при переходе на 2.0	
	
	//заполняем шапку документа
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	ОбщийМодуль.ЗаполнитьШапкуДокумента(НовыйДокумент);
	НовыйДокумент.Контрагент = ОбщийМодульСервер.НастройкаПользователя("КонтрагентТерминалаСамообслуживания");
	НовыйДокумент.ДоговорКонтрагента = НовыйДокумент.Контрагент.ОсновнойДоговор;
	НовыйДокумент.ВидЦен = НовыйДокумент.ДоговорКонтрагента.ВидЦен;
	НовыйДокумент.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.ВРаботе;
	НовыйДокумент.ИсточникЗаказа = Константы.ТерминалСамообслуживанияРекламныйИсточник.Получить();
	//Начало исключен при переходе на 2.0
	//Если НЕ Константы.СкладОтгрузкиПотолоковОтличаетсяОтСкладаГотовойПродукции.Получить() И ТипЗНЧ(НовыйДокумент.Ссылка) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
	//	НовыйДокумент.СкладОтгрузки = НовыйДокумент.Склад;
	//КонецЕсли;
	//Конец исключен при переходе на 2.0

	//заполняем табличную часть "Товары"
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		НоваяСтрока = НовыйДокумент.Товары.Добавить();
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.Характеристика;
		НоваяСтрока.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;		
		НоваяСтрока.Коэффициент = 1;
		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		НоваяСтрока.Цена = ТекущаяСтрока.Цена;
		НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
	КонецЦикла;
	
	НовыйДокумент.СуммаДокумента = НовыйДокумент.Товары.Итог("Сумма");
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		НомерСозданногоЗаказа = НовыйДокумент.Номер;
		Элементы.НомерСозданногоЗаказа.Видимость = Истина;
		Элементы.ДобавитьТовар.Доступность = Ложь;
		Элементы.УбратьТовар.Доступность = Ложь;
		ДокументЗаказ = НовыйДокумент.Ссылка;
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьЗаказ()
	Если ДокументЗаказ <> Неопределено Тогда
		Если ЗначениеЗаполнено(ДокументЗаказ) Тогда				
			Если ТипЗНЧ(ДокументЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				//Печать заказа покупателя				
				ТабличныйДокументЗаказ = ВернутьТабличныйДокументЗаказаПокупателя(ДокументЗаказ);
			Иначе
				//Печать заказа на производство				
				ТабличныйДокументЗаказ = ВернутьТабличныйДокументЗаказаНаПроизводство(ДокументЗаказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ВернутьТабличныйДокументЗаказаНаПроизводство(Документ)
	Возврат Документы.ЗаказНаПроизводство.СформироватьПечатнуюФормуЗаказаНаПроизводство(Документ.Ссылка)
КонецФункции

&НаСервере
Функция ВернутьТабличныйДокументЗаказаПокупателя(Документ)
	Массив = новый Массив;
	Массив.Добавить(Документ.Ссылка);
	Возврат Документы.ЗаказПокупателя.ПечатьЗаказПокупателя(Массив, Неопределено);
КонецФункции	

//СЕРВИСНЫЕ ИНТЕРФЕЙСНЫЕ ФУНКЦИИ
&НаКлиенте
Процедура ПоказатьСкрытьВкладки(Знач НомерВкладки)
	
	Элементы.ГруппаСтраницаНачальная.Видимость = Ложь;
	Элементы.ГруппаСтраницаСоставЗаказа.Видимость = Ложь;
	Элементы.ГруппаСтраницаВыбораТовара.Видимость = Ложь;
	Элементы.ГруппаСтраницаПечатьЗаказа.Видимость = Ложь;
	Элементы.ГруппаИнформацияОТоваре.Видимость = Ложь;
	Элементы.ГруппаВводПинКода.Видимость = Ложь;	
	
	Если НомерВкладки = 1 Тогда
		Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница = Элементы.ГруппаСтраницаНачальная;
		Элементы.ГруппаСтраницаНачальная.Видимость = Истина;
	ИначеЕсли НомерВкладки = 2 Тогда
		Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница = Элементы.ГруппаСтраницаСоставЗаказа;
		Элементы.ГруппаСтраницаСоставЗаказа.Видимость = Истина;
	ИначеЕсли НомерВкладки = 3 Тогда
		Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница = Элементы.ГруппаСтраницаВыбораТовара;
		Элементы.ГруппаСтраницаВыбораТовара.Видимость = Истина;
	ИначеЕсли НомерВкладки = 4 Тогда
		Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница = Элементы.ГруппаСтраницаПечатьЗаказа;
		Элементы.ГруппаСтраницаПечатьЗаказа.Видимость = Истина;
	ИначеЕсли НомерВкладки = 5 Тогда
		Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница = Элементы.ГруппаИнформацияОТоваре;
		Элементы.ГруппаИнформацияОТоваре.Видимость = Истина;
	ИначеЕсли НомерВкладки = 6 Тогда
		Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница = Элементы.ГруппаВводПинКода;
		Элементы.ГруппаВводПинКода.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ДекорацияКоличествоТоваровВКорзине.Заголовок = Объект.Товары.Итог("Количество");
	Элементы.ДекорацияСуммаТоваровВКорзине.Заголовок = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОСозданииЗаказа(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
        СоздатьДокументЗаказПокупателя();
    КонецЕсли;
КонецПроцедуры

//&НаСервере
//Функция ВВеденныйПИНКодЗакрытияВерный(Число)
//	Если Число = Константы.ТерминалСамообслуживанияПИНКодДляЗакрытия.Получить() Тогда
//		Возврат Истина;
//	КонецЕсли;
//	Возврат Ложь;
//КонецФункции

&НаКлиенте
Процедура ОбработкаВводаПинКодаЗакрытия(Число, Параметры) Экспорт
	//Если ВВеденныйПИНКодЗакрытияВерный(Число) Тогда
	Если Число = ПинКодДляЗакрытия Тогда
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;
КонецПроцедуры

//ФУНКЦИИ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПинКодДляЗакрытия = Константы.ТерминалСамообслуживанияПИНКодДляЗакрытия.Получить();		
	
	Попытка
		//Открытие окна на весь экран
		WSHShell = Новый COMОбъект("WScript.Shell");
	    WSHShell.SendKeys("% ");
	    WSHShell.SendKeys("{UP}{UP}{ENTER}");		
	Исключение
	КонецПопытки;
		
КонецПроцедуры

//ДЕЙСТВИЯ КНОПОК

&НаКлиенте
Процедура НовыйЗаказ(Команда)
	
	ДокументЗаказ = "";
	Объект.Товары.Очистить();
	ПоказатьСкрытьВкладки(2);
	
	Элементы.НомерСозданногоЗаказа.Видимость = Ложь;
	Элементы.ДобавитьТовар.Доступность = Истина;
	Элементы.УбратьТовар.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаОформленияЗаказа(Команда)
	
	Объект.Товары.Очистить();
	ПоказатьСкрытьВкладки(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	ПоказатьСкрытьВкладки(3);
	НомерСтраницыТоваров = 1;
	ОбновитьСписокТоваров(НомерСтраницыТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаВыбораТовара(Команда)
	
	ПоказатьСкрытьВкладки(2);
	
КонецПроцедуры

&НаКлиенте
Процедура СледущаяСтраницаТоваров(Команда)
	
	НомерСтраницыТоваров = НомерСтраницыТоваров+1;
	ОбновитьСписокТоваров(НомерСтраницыТоваров, ТекущаяГруппаТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяСтраницаТоваров(Команда)
	
	НомерСтраницыТоваров = НомерСтраницыТоваров-1;
	ОбновитьСписокТоваров(НомерСтраницыТоваров, ТекущаяГруппаТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяГруппаТоваров(Команда)
	
	ПоднятсяНаГруппуВыше();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоПлюс(Команда)
	КоличествоТовара = КоличествоТовара + 1;
КонецПроцедуры

&НаКлиенте
Процедура ТоварКоличествоМинус(Команда)
	Если КоличествоТовара > 1 Тогда
		КоличествоТовара = КоличествоТовара - 1;
	КонецЕсли;
КонецПроцедуры

&наСервере
Процедура ПеренестиТоварВЗаказНаСервере()
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Номенклатура = ВыбранныйТовар;
	НоваяСтрока.Характеристика = ВыбраннаяХарактеристика;
	НоваяСтрока.Количество = КоличествоТовара;
	НоваяСтрока.Цена = ЦенаТовара;
	НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
	НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиТоварВЗаказ(Команда)
	
	Если НЕ ВыбранныйТовар.Пустая() Тогда
		ПеренестиТоварВЗаказНаСервере();
	
		Состояние("Товар " + ВыбранныйТовар + " добавлен к заказу",);
		КоличествоТовара = 1;
		ВыбранныйТовар = "";
		Элементы.ПеренестиТоварВЗаказ.Доступность = Ложь;
	Иначе
		Состояние("Не выбран товар");
	КонецЕсли;
	
	ПоказатьСкрытьВкладки(3);
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьТовар(Команда)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Объект.Товары.Удалить(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаказ(Команда)
	Если ДокументЗаказ = Неопределено Тогда		
		Если Объект.Товары.Количество() > 0 Тогда
			ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ОбработкаВопросаОСозданииЗаказа", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияВопроса,"Оформить заказ?",РежимДиалогаВопрос.ДаНет);
		Иначе
			Состояние("Не выбран товар");
		КонецЕсли;
	Иначе 
		Если ДокументЗаказ.Пустая() Тогда
			Если Объект.Товары.Количество() > 0 Тогда
				ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ОбработкаВопросаОСозданииЗаказа", ЭтотОбъект);
				ПоказатьВопрос(ОписаниеОповещенияВопроса,"Оформить заказ?",РежимДиалогаВопрос.ДаНет);
			Иначе
				Состояние("Не выбран товар");
			КонецЕсли;
		Иначе	
			Состояние("Заказ уже оформлен");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаказа(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДокументЗаказ) Тогда
		Состояние("Предварительно следует оформить заказ");
	Иначе
		ПоказатьСкрытьВкладки(4);
		РаспечататьЗаказ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПечатнуюФормуЗаказа(Команда)
	ПоказатьСкрытьВкладки(2);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УбратьПанелиИнтерфейсаНаСервере();
	ОбновитьИнтерфейс();
	ПоказатьСкрытьВкладки(1);	
	
	Попытка
		//Открытие окна на весь экран
		WSHShell = Новый COMОбъект("WScript.Shell");
	    WSHShell.SendKeys("% ");
	    WSHShell.SendKeys("{UP}{UP}{ENTER}");		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара2Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(2);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара3Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(3);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара4Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(4);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара5Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(5);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара6Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(6);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара7Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(7);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара8Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(8);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара9Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(9);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара10Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(10);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара11Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(11);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара12Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(12);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара13Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(13);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара14Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(14);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара15Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(15);
КонецПроцедуры

&НаКлиенте
Процедура КартинкаТовара1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранТовар(1);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСпискуТоваров(Команда)
	ПоказатьСкрытьВкладки(3);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	//Отказ = Истина; 
	//ОП = Новый ОписаниеОповещения("ОбработкаВводаПинКодаЗакрытия", ЭтотОбъект);  - ругается на вызов серверного метода
	//ПоказатьВводЧисла(ОП, 0, "Введите ПИН-код для закрытия", 4, 0);
	
	Отказ = Истина;	//выводит стандартное окно Продолжить или Завершить
	СтандартнаяОбработка = Ложь;		
	
	//Запомним текущую вкладку: кроме вкладки пин кода (вдруг ещё раз попытаются закрыть)
	Если Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница.Имя = "ГруппаСтраницаНачальная" Тогда
		мПоследняяВкладка = 1;
	ИначеЕсли Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница.Имя = "ГруппаСтраницаСоставЗаказа" Тогда
		мПоследняяВкладка = 2;
	ИначеЕсли Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница.Имя = "ГруппаСтраницаВыбораТовара" Тогда
		мПоследняяВкладка = 3;
	ИначеЕсли Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница.Имя = "ГруппаСтраницаПечатьЗаказа" Тогда
		мПоследняяВкладка = 4;
	ИначеЕсли Элементы.ГруппаСтраницыЭкрана.ТекущаяСтраница.Имя = "ГруппаИнформацияОТоваре" Тогда
		мПоследняяВкладка = 5;
	КонецЕсли;	
	
	ПоказатьСкрытьВкладки(6);

КонецПроцедуры

&НаКлиенте
Процедура СписокХарактеристикиПриАктивизацииСтроки(Элемент)
	ВыбраннаяХарактеристика = Элементы.СписокХарактеристики.ТекущиеДанные.Значение;
	ЦенаТовара = ПолучитьЦенуТовара(ВыбранныйТовар, ВыбраннаяХарактеристика);
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяОбратно(Команда)
	ПоказатьСкрытьВкладки(мПоследняяВкладка);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	Если ПинКод = ПинКодДляЗакрытия Тогда
		ЗавершитьРаботуСистемы(Ложь);		
	КонецЕсли;	
КонецПроцедуры
